In [45]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

from preparar_dataset import preparar_dataset

In [46]:
pd.set_option('display.max_rows', None)
pd.set_option('display.max_columns', None)

In [53]:
ruta = '../data/loan.csv'
df = pd.read_csv(ruta)
print(df.shape)
#df.drop('policy_id', axis=1, inplace=True) 
df.head()

(614, 12)

,Gender,Married,Dependents,Education,Self_Employed,Applicant_Income,Coapplicant_Income,Loan_Amount,Term,Credit_History,Area,Status
0,Male,No,0,Graduate,No,584900,0.0,15000000,360.0,1.0,Urban,Y
1,Male,Yes,1,Graduate,No,458300,150800.0,12800000,360.0,1.0,Rural,N
2,Male,Yes,0,Graduate,Yes,300000,0.0,6600000,360.0,1.0,Urban,Y
3,Male,Yes,0,Not Graduate,No,258300,235800.0,12000000,360.0,1.0,Urban,Y
4,Male,No,0,Graduate,No,600000,0.0,14100000,360.0,1.0,Urban,Y

In [54]:
df['Status'].value_counts()

Status
Y    422
N    192
Name: count, dtype: int64

In [55]:
df.isna().sum()

Gender                13
Married                3
Dependents            15
Education              0
Self_Employed         32
Applicant_Income       0
Coapplicant_Income     0
Loan_Amount            0
Term                  14
Credit_History        50
Area                   0
Status                 0
dtype: int64

In [56]:
df_procesado = preparar_dataset(df, tipo_escalado = "standard", imputar = False)
print(df_procesado.shape)
df_procesado.head()

(614, 12)

,Applicant_Income,Coapplicant_Income,Loan_Amount,Term,Credit_History,Gender,Married,Dependents,Education,Self_Employed,Area,Status
0,0.072991,-0.554487,0.097515,0.276642,0.432861,1.0,0.0,0.0,0.0,0.0,2.0,1.0
1,-0.134412,-0.038732,-0.152244,0.276642,0.432861,1.0,1.0,1.0,0.0,0.0,0.0,0.0
2,-0.393747,-0.554487,-0.856110,0.276642,0.432861,1.0,1.0,0.0,0.0,1.0,2.0,1.0
3,-0.462062,0.251980,-0.243065,0.276642,0.432861,1.0,1.0,0.0,1.0,0.0,2.0,1.0
4,0.097728,-0.554487,-0.004659,0.276642,0.432861,1.0,0.0,0.0,0.0,0.0,2.0,1.0

In [57]:
df_procesado['Gender'].isna().sum()

np.int64(13)

In [58]:
df_procesado.to_csv('../data/df_limpio.csv', index = False)